ErpTest/src/InformationRegisters/уатНоменклатураГСМ/уатНоменклатураГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уатНоменклатураГСМ</name>
  <comment>Доп. сведения для ГСМ</comment>
  <resources>
    <name>ВестиУчетОстатковТЖ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ГруппаГСМ</name>
    <type>
      <types>EnumRef.уатГруппыГСМ</types>
    </type>
  </resources>
  <resources>
    <name>ГСМТалона</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>ЛитровыйТалон</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НоминалТалона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Плотность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/уатНоменклатураГСМ/Forms/ФормаСписка/Module.bsl
&НаСервере
Функция КлючЗаписиРегистра()
	КлючЗаписи = РегистрыСведений.уатНоменклатураГСМ.СоздатьКлючЗаписи(Новый Структура("Номенклатура", ТекГСМ));
	Возврат КлючЗаписи;
КонецФункции


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если РежимВыбораГСМ Тогда
		СтандартнаяОбработка = Ложь;
		ТекСтрока = Элементы.Список.ТекущиеДанные;
		Закрыть(ТекСтрока.Номенклатура);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьГСМ(Команда)
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		Закрыть(ТекСтрока.Номенклатура)
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//уатЗащищенныеФункцииСервер.уатРегистрФормаСпискаПриСозданииНаСервере(Отказ, СтандартнаяОбработка,ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ВыборГСМ") И Параметры.ВыборГСМ = Истина Тогда
		РежимВыбораГСМ = Истина;
		Если Параметры.Свойство("ГруппаГСМ") И ЗначениеЗаполнено(Параметры.ГруппаГСМ) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ГруппаГСМ", Параметры.ГруппаГСМ,
				ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
		КонецЕсли;
		Элементы.ВыбратьГСМ.Видимость = Истина;
		Если Параметры.Свойство("НачальноеЗначениеВыбора") И ЗначениеЗаполнено(Параметры.НачальноеЗначениеВыбора) Тогда
			ТекГСМ = Параметры.НачальноеЗначениеВыбора;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(ТекГСМ) Тогда
		Элементы.Список.ТекущаяСтрока = КлючЗаписиРегистра();
	КонецЕсли;
КонецПроцедуры
